In [1]:
import pandas as pd
import numpy as np

### 设置数值

In [2]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20180330',periods=6))
s1

2018-03-30    1
2018-03-31    2
2018-04-01    3
2018-04-02    4
2018-04-03    5
2018-04-04    6
Freq: D, dtype: int64

可以看出pd的data函数在时间周期（比如闰年平年、闰月等）表示无误

In [3]:
df=pd.DataFrame(np.random.randn(6,4),index=pd.date_range('20180330',periods=6),columns=list('ABCD'))
df

                   A         B         C         D
2018-03-30 -1.193201 -0.149307  0.538477 -0.279053
2018-03-31 -0.174791  0.150633 -0.388464  0.363270
2018-04-01 -0.101599 -1.267092  0.738212 -0.390935
2018-04-02  0.699977  1.441209  0.613911  0.573727
2018-04-03 -0.949858 -1.990643  0.675866 -0.413000
2018-04-04  0.288786  1.393433  0.362447  0.625606

In [4]:
df['E']=s1
df

                   A         B         C         D  E
2018-03-30 -1.193201 -0.149307  0.538477 -0.279053  1
2018-03-31 -0.174791  0.150633 -0.388464  0.363270  2
2018-04-01 -0.101599 -1.267092  0.738212 -0.390935  3
2018-04-02  0.699977  1.441209  0.613911  0.573727  4
2018-04-03 -0.949858 -1.990643  0.675866 -0.413000  5
2018-04-04  0.288786  1.393433  0.362447  0.625606  6

In [5]:
df.at['20180403','E']=8 #通过标签
df

                   A         B         C         D  E
2018-03-30 -1.193201 -0.149307  0.538477 -0.279053  1
2018-03-31 -0.174791  0.150633 -0.388464  0.363270  2
2018-04-01 -0.101599 -1.267092  0.738212 -0.390935  3
2018-04-02  0.699977  1.441209  0.613911  0.573727  4
2018-04-03 -0.949858 -1.990643  0.675866 -0.413000  8
2018-04-04  0.288786  1.393433  0.362447  0.625606  6

In [6]:
df.iat[5,4]=10 #通过坐标
df

                   A         B         C         D   E
2018-03-30 -1.193201 -0.149307  0.538477 -0.279053   1
2018-03-31 -0.174791  0.150633 -0.388464  0.363270   2
2018-04-01 -0.101599 -1.267092  0.738212 -0.390935   3
2018-04-02  0.699977  1.441209  0.613911  0.573727   4
2018-04-03 -0.949858 -1.990643  0.675866 -0.413000   8
2018-04-04  0.288786  1.393433  0.362447  0.625606  10

In [7]:
df.loc[:,'D']=np.array([5]*6) #通过numpy
df

                   A         B         C  D   E
2018-03-30 -1.193201 -0.149307  0.538477  5   1
2018-03-31 -0.174791  0.150633 -0.388464  5   2
2018-04-01 -0.101599 -1.267092  0.738212  5   3
2018-04-02  0.699977  1.441209  0.613911  5   4
2018-04-03 -0.949858 -1.990643  0.675866  5   8
2018-04-04  0.288786  1.393433  0.362447  5  10

In [8]:
len(df)

6

In [9]:
df.shape

(6, 5)

In [10]:
df2=df.copy()

In [11]:
df2==df

               A     B     C     D     E
2018-03-30  True  True  True  True  True
2018-03-31  True  True  True  True  True
2018-04-01  True  True  True  True  True
2018-04-02  True  True  True  True  True
2018-04-03  True  True  True  True  True
2018-04-04  True  True  True  True  True

In [12]:
id(df2)

1899004252568

In [13]:
id(df)

1899003989856

In [14]:
df2[df2>0]

                   A         B         C  D   E
2018-03-30       NaN       NaN  0.538477  5   1
2018-03-31       NaN  0.150633       NaN  5   2
2018-04-01       NaN       NaN  0.738212  5   3
2018-04-02  0.699977  1.441209  0.613911  5   4
2018-04-03       NaN       NaN  0.675866  5   8
2018-04-04  0.288786  1.393433  0.362447  5  10

### 缺失值处理

#### 构建数据

In [15]:
df

                   A         B         C  D   E
2018-03-30 -1.193201 -0.149307  0.538477  5   1
2018-03-31 -0.174791  0.150633 -0.388464  5   2
2018-04-01 -0.101599 -1.267092  0.738212  5   3
2018-04-02  0.699977  1.441209  0.613911  5   4
2018-04-03 -0.949858 -1.990643  0.675866  5   8
2018-04-04  0.288786  1.393433  0.362447  5  10

In [16]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [17]:
type(df.columns)

pandas.core.indexes.base.Index

In [18]:
list(df.columns)

['A', 'B', 'C', 'D', 'E']

In [19]:
dates=pd.date_range('20180331',periods=4)
dates

DatetimeIndex(['2018-03-31', '2018-04-01', '2018-04-02', '2018-04-03'], dtype='datetime64[ns]', freq='D')

In [20]:
df2=df.reindex(index=dates,columns=list(df.columns[:2])+['F'])
df2

                   A         B   F
2018-03-31 -0.174791  0.150633 NaN
2018-04-01 -0.101599 -1.267092 NaN
2018-04-02  0.699977  1.441209 NaN
2018-04-03 -0.949858 -1.990643 NaN

In [21]:
df2.loc[dates[:2],'F']=2
df2

                   A         B    F
2018-03-31 -0.174791  0.150633  2.0
2018-04-01 -0.101599 -1.267092  2.0
2018-04-02  0.699977  1.441209  NaN
2018-04-03 -0.949858 -1.990643  NaN

#### 缺失值处理

In [22]:
df2.dropna() #去掉包含缺失值 np.nan 的行

                   A         B    F
2018-03-31 -0.174791  0.150633  2.0
2018-04-01 -0.101599 -1.267092  2.0

In [23]:
df2.fillna(value=4) #缺失值填充

                   A         B    F
2018-03-31 -0.174791  0.150633  2.0
2018-04-01 -0.101599 -1.267092  2.0
2018-04-02  0.699977  1.441209  4.0
2018-04-03 -0.949858 -1.990643  4.0

In [24]:
df2.isnull() #返回缺失值位置

                A      B      F
2018-03-31  False  False  False
2018-04-01  False  False  False
2018-04-02  False  False   True
2018-04-03  False  False   True

In [25]:
pd.isnull(df2)

                A      B      F
2018-03-31  False  False  False
2018-04-01  False  False  False
2018-04-02  False  False   True
2018-04-03  False  False   True